[
  {
    "path": "posts/welcome/",
    "title": "Welcome to bblog",
    "description": "hg",
    "author": [
      {
        "name": "Batuhan Akçabozan",
        "url": {}
      }
    ],
    "date": "2021-11-07",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-11-14T17:31:43+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-11-07-post/",
    "title": "Random Variables",
    "description": "first post",
    "author": [
      {
        "name": "Batuhan Akçabozan",
        "url": {}
      }
    ],
    "date": "2021-11-07",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nRandom Variables\r\n\r\n\r\n\r\nLet’s imagine we measured weight of 12 mice. Half treated with a special diet (treatment), other half with usual diet (control). We want to know whether this different diet has an effect on mouse weight or not.\r\n\r\n# A tibble: 12 x 2\r\n# Groups:   condition [2]\r\n   condition weight\r\n   <chr>      <dbl>\r\n 1 control     16.3\r\n 2 control     16.9\r\n 3 control     17.9\r\n 4 control     19.5\r\n 5 control     16.0\r\n 6 control     19.5\r\n 7 treatment   23.4\r\n 8 treatment   21.9\r\n 9 treatment   23.8\r\n10 treatment   22.5\r\n11 treatment   23.6\r\n12 treatment   25.0\r\n\r\nWe then calculate the mean of each group and look at the mean difference of weights.\r\n\\[\r\nμ_t - μ_c = 5.69 \r\n\\]\r\nResults indicate that treated mice are on average 32% heavier than the control ones. So why can’t we just leave it there?\r\nBecause the average values that we get are random variables. If we were to sample and measure another 12 mice for this experiment, we would get a different mean value. In fact these random variables are distribution of values. For example, if we took 10000 samples from the mouse population and measured the mean of these measurements, this would illustrate how this random variable is indeed random and that it varies.\r\n\r\n\r\n\r\nThus we can’t just say: ooh treated mice are 32%* heavier.. We need p-values, Confidence Intervals. There is a variability and we need to take this into account.\r\nNull Distribution\r\nLet’s order 20 mice and divide them randomly into groups of 10 and this time feed them with the same diet. Then again let’s calculate the mean difference of these groups and repeat this 10000 times. When we plot these mean differences we would get a distribution called Null distribution\r\n\r\n\r\n\r\nThis distribution basically shows the variability of random variables (in this case as mean difference), when there is actually no difference. Another thing it shows is that how probable it is to observe a certain value. In this case, how probable it is to observe a mean difference value of x when there is no difference in compared populations.\r\nSuppose that the mean difference of weight between treated mice and control mice was 1.55. If we look at our null distribution graph and calculate the percentage of the area that is higher than 1.55, we would see that it is approximately 6% of the plot. This means that, if there was no difference between groups; 6% of the time, we would get a value of 1.55 or higher. And this would be our p-value\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-11-07-post/post_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2021-11-14T20:25:18+01:00",
    "input_file": "post.knit.md",
    "preview_width": 1248,
    "preview_height": 768
  }
]
